---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSize.NominalDiameter
source: html/7030f2fe-fa74-64bc-ed7f-19b7516ecd7a.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSize.NominalDiameter Property

Nominal diameter

## Syntax (C#)
```csharp
public double NominalDiameter { get; }
```